choose_by_title = 'Введите название игры или его часть'
no_result_by_title = 'По вашему запросу *{0}* ничего не найдено'

admin = '@outlos'

start_message = f'''Здравствуйте❕

В данном боте вы можете найти игру для ПК и скачать торрент файл.
Большинство торрент трекеров заблокированы. Тут вы можете скачать торрент файл без ограничений и абсолютно бесплатно.
База постоянно пополняется.

Подпишись на наш Канал:
<a href="https://t.me/канал ">Fit-girl-Channel</a>

По вопросам рекламы и сотрудничества, обращайтесь - {admin}
'''

admin_start_message = '''Вы являетесь администратором данного приложения. Выберите один из пунктов'''

add_new_post = '''☝️☝️☝️Чтобы добавить своё предложение вам необходимо отправить <b><i>ФОТО</i></b> и добавить к нему <b><i>ОПИСАНИЕ</i></b>:'''
add_new_post_await = '''🚀 Сообщение отправлено на модерацию. Подождите пожалуйста'''
add_new_post_error = '''‼️ Внимание ‼️ Ваш пост не принят, необходимо отправить одно фото и описание к нему‼️'''
add_new_post_error_word = '''‼️ Внимание ‼️ Ваш пост не принят, так как содержит запрещенное слово <code>{0}</code>'''
add_new_post_error_no_photo = '''‼️ Внимание ‼️ Ваш пост не принят, так как не было отправлено фото. Отправьто фото + описание к нему'''
add_new_post_error_no_text = '''‼️ Внимание ‼️ Ваш пост не принят, так как не был отправлен текст. Отправьто фото + описание к нему'''
add_new_post_error_1024 = '''‼️ Внимание ‼️ Ваш пост не принят, так как содержит более 1000 символов.'''
add_new_post_success = '''🥳 🎉 Поздравляем! Ваш пост успешно опубликован!'''
add_new_post_fail = '''‼️ Внимание ‼️ Ваш пост <b>НЕ</b> опубликован, при необходимости свяжитесь с администратором'''
new_post_awaits = '''👌 Новый пост для модерации ожидает. Зайдите в панель администратора и проверьте новые сообщения /admin'''

how_to_use = '''1)Нажмите на кнопку в меню «добавить пост»
\n2)Прикрепите только ОДНУ фотографию (не добавляйте больше одного фото) + добавьте описание для вашего объявления.
\n3)Далее ваше объявление отправляется на модерацию, в скором времени админ проверит его и выложит
'''

contact_admin = f'''Если имеются вопросы к администратору, обращайтесь - {admin}'''

adds_contacts = f'''По вопросам рекламы и сотрудничества, обращайтесь - {admin}'''
# adds_price = '''***Прайс***\n***Условия***\n***Контакты***'''
adds_price = f'''По вопросам рекламы и сотрудничества, обращайтесь - {admin}'''
message_accepted = '👌 Сообщение #id{0} принято! Будет отправлено в соответствующую группу в ближайшее время'
message_declined = '🚯 Сообщение #id{0} отклонено 🚯'

choose_city = '🌇 Выберите ваш город:'
instructions = '''Подробная инструкция ***** '''
check_posts = '''⬇️ В базе данных <i><b><strong>{0}</strong></b></i> поста(ов) для модерации.\n️Вывожу по 10 постов️'''

add_city = '''Введите новый город: '''
add_city_success = '''Город {0} успешно добавлен!'''
add_city_fail = '''Ошибка! Необходимо ввести название города. Без чисел и знаков'''
delete_city = '''Город {0} успешно Удалён!'''

add_channel = '''Введите ссылку на новый канал: '''
add_channel_success = '''Канал <code>{0}</code> успешно добавлен!'''
add_channel_fail = '''Ошибка! Необходимо ввести ссылку на канал формата <i>https://t.me/channel_name</i>'''
delete_channel = '''Канал <code>{0}</code> успешно Удалён!'''

set_delay = '''Текущая задержка <code>{0}</code> минут.'''
set_delay_success = '''Время задержки успешно обновлено. Текущая задержка <code>{0}</code> минут.'''
set_delay_fail = '''Ошибка! Необходимо ввести число равное количеству минут. Без буквенных 
                    и других символов. Число не должно начинаться с нуля'''
